#### Handle Categorical Features

### One Hot Encoding

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv('Titanic_dataset.csv',usecols=['Sex'])
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [8]:
pd.get_dummies(df,drop_first=True).head(20)

    Sex_male
0          1
1          0
2          0
3          0
4          1
5          1
6          1
7          1
8          0
9          0
10         0
11         0
12         1
13         1
14         0
15         0
16         1
17         1
18         0
19         0

In [9]:
df=pd.read_csv('Titanic_dataset.csv',usecols=['Embarked'])
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [10]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [11]:
df.dropna(inplace=True)

In [12]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [14]:
df.shape

(889, 1)

In [16]:
df.isnull().sum()

Embarked    0
dtype: int64

In [18]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1